
## :x: Apply Failed

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7637598565)



<pre><code>Error: Error when reading or editing Resource gig-japan-398904 for IAM Member (role &#34;serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34;, &#34;roles/editor&#34;): Request `Delete IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for &#34;project \&#34;gig-japan-398904\&#34;&#34;` returned error: Batch request and retried single request &#34;Delete IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for \&#34;project \\\&#34;gig-japan-398904\\\&#34;\&#34;&#34; both failed. Final error: Error applying IAM policy for project &#34;gig-japan-398904&#34;: Error setting IAM policy for project &#34;gig-japan-398904&#34;: googleapi: Error 403: Policy update access denied., forbidden


Error: Request `Create IAM Members roles/artifactregistry.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project &#34;gig-japan-398904&#34;` returned error: Batch request and retried single request &#34;Create IAM Members roles/artifactregistry.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project \&#34;gig-japan-398904\&#34;&#34; both failed. Final error: Error applying IAM policy for project &#34;gig-japan-398904&#34;: Error setting IAM policy for project &#34;gig-japan-398904&#34;: googleapi: Error 403: Policy update access denied., forbidden

  with google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/artifactregistry.admin&#34;],
  on iam.tf line 54, in resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34;:
  54: resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34; {


Error: Request `Create IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project &#34;gig-japan-398904&#34;` returned error: Batch request and retried single request &#34;Create IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project \&#34;gig-japan-398904\&#34;&#34; both failed. Final error: Error applying IAM policy for project &#34;gig-japan-398904&#34;: Error setting IAM policy for project &#34;gig-japan-398904&#34;: googleapi: Error 403: Policy update access denied., forbidden

  with google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/editor&#34;],
  on iam.tf line 54, in resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34;:
  54: resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34; {


Error: Request `Create IAM Members roles/secretmanager.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project &#34;gig-japan-398904&#34;` returned error: Batch request and retried single request &#34;Create IAM Members roles/secretmanager.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project \&#34;gig-japan-398904\&#34;&#34; both failed. Final error: Error applying IAM policy for project &#34;gig-japan-398904&#34;: Error setting IAM policy for project &#34;gig-japan-398904&#34;: googleapi: Error 403: Policy update access denied., forbidden

  with google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/secretmanager.admin&#34;],
  on iam.tf line 54, in resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34;:
  54: resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34; {


Error: Error creating Repository: googleapi: Error 403: Permission denied on &#39;locations/asia-northeast&#39; (or it may not exist).

  with google_artifact_registry_repository.artifact-repository,
  on main.tf line 13, in resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34;:
  13: resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34; {

::debug::Terraform exited with code 1.
::debug::stdout: google_project_service.api-resources[&#34;artifactregistry.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0Agoogle_project_iam_member.gitops-sa-cloudstorage: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  &#43; create%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be created%0A  &#43; resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34; {%0A      &#43; create_time      = (known after apply)%0A      &#43; effective_labels = (known after apply)%0A      &#43; format           = &#34;DOCKER&#34;%0A      &#43; id               = (known after apply)%0A      &#43; location         = &#34;asia-northeast&#34;%0A      &#43; mode             = &#34;STANDARD_REPOSITORY&#34;%0A      &#43; name             = (known after apply)%0A      &#43; project          = &#34;gig-japan-398904&#34;%0A      &#43; repository_id    = &#34;ikigai.app&#34;%0A      &#43; terraform_labels = (known after apply)%0A      &#43; update_time      = (known after apply)%0A%0A      &#43; docker_config {%0A          &#43; immutable_tags = true%0A        }%0A    }%0A%0A  # google_project_iam_member.gitops-sa-cloudstorage will be destroyed%0A  # (because resource uses count or for_each)%0A  - resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34; {%0A      - etag    = &#34;BwYPrS5O5xM=&#34; -&gt; null%0A      - id      = &#34;gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34; -&gt; null%0A      - member  = &#34;serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34; -&gt; null%0A      - project = &#34;gig-japan-398904&#34; -&gt; null%0A      - role    = &#34;roles/editor&#34; -&gt; null%0A    }%0A%0A  # google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/artifactregistry.admin&#34;] will be created%0A  &#43; resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34; {%0A      &#43; etag    = (known after apply)%0A      &#43; id      = (known after apply)%0A      &#43; member  = &#34;serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34;%0A      &#43; project = &#34;gig-japan-398904&#34;%0A      &#43; role    = &#34;roles/artifactregistry.admin&#34;%0A    }%0A%0A  # google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/editor&#34;] will be created%0A  &#43; resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34; {%0A      &#43; etag    = (known after apply)%0A      &#43; id      = (known after apply)%0A      &#43; member  = &#34;serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34;%0A      &#43; project = &#34;gig-japan-398904&#34;%0A      &#43; role    = &#34;roles/editor&#34;%0A    }%0A%0A  # google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/secretmanager.admin&#34;] will be created%0A  &#43; resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34; {%0A      &#43; etag    = (known after apply)%0A      &#43; id      = (known after apply)%0A      &#43; member  = &#34;serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34;%0A      &#43; project = &#34;gig-japan-398904&#34;%0A      &#43; role    = &#34;roles/secretmanager.admin&#34;%0A    }%0A%0APlan: 4 to add, 0 to change, 1 to destroy.%0Agoogle_project_iam_member.gitops-sa-cloudstorage: Destroying... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-cloudstorage[&#34;roles/editor&#34;]: Creating...%0Agoogle_project_iam_member.gitops-sa-cloudstorage[&#34;roles/artifactregistry.admin&#34;]: Creating...%0Agoogle_project_iam_member.gitops-sa-cloudstorage[&#34;roles/secretmanager.admin&#34;]: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Creating...%0A
::debug::stderr: %0AError: Error when reading or editing Resource gig-japan-398904 for IAM Member (role &#34;serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com&#34;, &#34;roles/editor&#34;): Request `Delete IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for &#34;project \&#34;gig-japan-398904\&#34;&#34;` returned error: Batch request and retried single request &#34;Delete IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for \&#34;project \\\&#34;gig-japan-398904\\\&#34;\&#34;&#34; both failed. Final error: Error applying IAM policy for project &#34;gig-japan-398904&#34;: Error setting IAM policy for project &#34;gig-japan-398904&#34;: googleapi: Error 403: Policy update access denied., forbidden%0A%0A%0AError: Request `Create IAM Members roles/artifactregistry.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project &#34;gig-japan-398904&#34;` returned error: Batch request and retried single request &#34;Create IAM Members roles/artifactregistry.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project \&#34;gig-japan-398904\&#34;&#34; both failed. Final error: Error applying IAM policy for project &#34;gig-japan-398904&#34;: Error setting IAM policy for project &#34;gig-japan-398904&#34;: googleapi: Error 403: Policy update access denied., forbidden%0A%0A  with google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/artifactregistry.admin&#34;],%0A  on iam.tf line 54, in resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34;:%0A  54: resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34; {%0A%0A%0AError: Request `Create IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project &#34;gig-japan-398904&#34;` returned error: Batch request and retried single request &#34;Create IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project \&#34;gig-japan-398904\&#34;&#34; both failed. Final error: Error applying IAM policy for project &#34;gig-japan-398904&#34;: Error setting IAM policy for project &#34;gig-japan-398904&#34;: googleapi: Error 403: Policy update access denied., forbidden%0A%0A  with google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/editor&#34;],%0A  on iam.tf line 54, in resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34;:%0A  54: resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34; {%0A%0A%0AError: Request `Create IAM Members roles/secretmanager.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project &#34;gig-japan-398904&#34;` returned error: Batch request and retried single request &#34;Create IAM Members roles/secretmanager.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project \&#34;gig-japan-398904\&#34;&#34; both failed. Final error: Error applying IAM policy for project &#34;gig-japan-398904&#34;: Error setting IAM policy for project &#34;gig-japan-398904&#34;: googleapi: Error 403: Policy update access denied., forbidden%0A%0A  with google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/secretmanager.admin&#34;],%0A  on iam.tf line 54, in resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34;:%0A  54: resource &#34;google_project_iam_member&#34; &#34;gitops-sa-cloudstorage&#34; {%0A%0A%0AError: Error creating Repository: googleapi: Error 403: Permission denied on &#39;locations/asia-northeast&#39; (or it may not exist).%0A%0A  with google_artifact_registry_repository.artifact-repository,%0A  on main.tf line 13, in resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34;:%0A  13: resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34; {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/7e9b6326-0799-4027-a2cf-36fd727afa73/terraform-bin apply -input=false -auto-approve -lock=false -no-color
google_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]
google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]
google_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]
google_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]
google_project_iam_member.gitops-sa-cloudstorage: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_artifact_registry_repository.artifact-repository will be created
  + resource "google_artifact_registry_repository" "artifact-repository" {
      + create_time      = (known after apply)
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-northeast"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "gig-japan-398904"
      + repository_id    = "ikigai.app"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)

      + docker_config {
          + immutable_tags = true
        }
    }

  # google_project_iam_member.gitops-sa-cloudstorage will be destroyed
  # (because resource uses count or for_each)
  - resource "google_project_iam_member" "gitops-sa-cloudstorage" {
      - etag    = "BwYPrS5O5xM=" -> null
      - id      = "gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - project = "gig-japan-398904" -> null
      - role    = "roles/editor" -> null
    }

  # google_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"] will be created
  + resource "google_project_iam_member" "gitops-sa-cloudstorage" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/artifactregistry.admin"
    }

  # google_project_iam_member.gitops-sa-cloudstorage["roles/editor"] will be created
  + resource "google_project_iam_member" "gitops-sa-cloudstorage" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/editor"
    }

  # google_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"] will be created
  + resource "google_project_iam_member" "gitops-sa-cloudstorage" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/secretmanager.admin"
    }

Plan: 4 to add, 0 to change, 1 to destroy.
google_project_iam_member.gitops-sa-cloudstorage: Destroying... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-cloudstorage["roles/editor"]: Creating...
google_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"]: Creating...
google_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"]: Creating...
google_artifact_registry_repository.artifact-repository: Creating...

Error: Error when reading or editing Resource gig-japan-398904 for IAM Member (role "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com", "roles/editor"): Request `Delete IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for "project \"gig-japan-398904\""` returned error: Batch request and retried single request "Delete IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for \"project \\\"gig-japan-398904\\\"\"" both failed. Final error: Error applying IAM policy for project "gig-japan-398904": Error setting IAM policy for project "gig-japan-398904": googleapi: Error 403: Policy update access denied., forbidden


Error: Request `Create IAM Members roles/artifactregistry.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project "gig-japan-398904"` returned error: Batch request and retried single request "Create IAM Members roles/artifactregistry.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project \"gig-japan-398904\"" both failed. Final error: Error applying IAM policy for project "gig-japan-398904": Error setting IAM policy for project "gig-japan-398904": googleapi: Error 403: Policy update access denied., forbidden

  with google_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"],
  on iam.tf line 54, in resource "google_project_iam_member" "gitops-sa-cloudstorage":
  54: resource "google_project_iam_member" "gitops-sa-cloudstorage" {


Error: Request `Create IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project "gig-japan-398904"` returned error: Batch request and retried single request "Create IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project \"gig-japan-398904\"" both failed. Final error: Error applying IAM policy for project "gig-japan-398904": Error setting IAM policy for project "gig-japan-398904": googleapi: Error 403: Policy update access denied., forbidden

  with google_project_iam_member.gitops-sa-cloudstorage["roles/editor"],
  on iam.tf line 54, in resource "google_project_iam_member" "gitops-sa-cloudstorage":
  54: resource "google_project_iam_member" "gitops-sa-cloudstorage" {


Error: Request `Create IAM Members roles/secretmanager.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project "gig-japan-398904"` returned error: Batch request and retried single request "Create IAM Members roles/secretmanager.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project \"gig-japan-398904\"" both failed. Final error: Error applying IAM policy for project "gig-japan-398904": Error setting IAM policy for project "gig-japan-398904": googleapi: Error 403: Policy update access denied., forbidden

  with google_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"],
  on iam.tf line 54, in resource "google_project_iam_member" "gitops-sa-cloudstorage":
  54: resource "google_project_iam_member" "gitops-sa-cloudstorage" {


Error: Error creating Repository: googleapi: Error 403: Permission denied on 'locations/asia-northeast' (or it may not exist).

  with google_artifact_registry_repository.artifact-repository,
  on main.tf line 13, in resource "google_artifact_registry_repository" "artifact-repository":
  13: resource "google_artifact_registry_repository" "artifact-repository" {

::debug::Terraform exited with code 1.
::debug::stdout: google_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0Agoogle_project_iam_member.gitops-sa-cloudstorage: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be created%0A  + resource "google_artifact_registry_repository" "artifact-repository" {%0A      + create_time      = (known after apply)%0A      + effective_labels = (known after apply)%0A      + format           = "DOCKER"%0A      + id               = (known after apply)%0A      + location         = "asia-northeast"%0A      + mode             = "STANDARD_REPOSITORY"%0A      + name             = (known after apply)%0A      + project          = "gig-japan-398904"%0A      + repository_id    = "ikigai.app"%0A      + terraform_labels = (known after apply)%0A      + update_time      = (known after apply)%0A%0A      + docker_config {%0A          + immutable_tags = true%0A        }%0A    }%0A%0A  # google_project_iam_member.gitops-sa-cloudstorage will be destroyed%0A  # (because resource uses count or for_each)%0A  - resource "google_project_iam_member" "gitops-sa-cloudstorage" {%0A      - etag    = "BwYPrS5O5xM=" -> null%0A      - id      = "gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null%0A      - member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null%0A      - project = "gig-japan-398904" -> null%0A      - role    = "roles/editor" -> null%0A    }%0A%0A  # google_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"] will be created%0A  + resource "google_project_iam_member" "gitops-sa-cloudstorage" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"%0A      + project = "gig-japan-398904"%0A      + role    = "roles/artifactregistry.admin"%0A    }%0A%0A  # google_project_iam_member.gitops-sa-cloudstorage["roles/editor"] will be created%0A  + resource "google_project_iam_member" "gitops-sa-cloudstorage" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"%0A      + project = "gig-japan-398904"%0A      + role    = "roles/editor"%0A    }%0A%0A  # google_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"] will be created%0A  + resource "google_project_iam_member" "gitops-sa-cloudstorage" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"%0A      + project = "gig-japan-398904"%0A      + role    = "roles/secretmanager.admin"%0A    }%0A%0APlan: 4 to add, 0 to change, 1 to destroy.%0Agoogle_project_iam_member.gitops-sa-cloudstorage: Destroying... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-cloudstorage["roles/editor"]: Creating...%0Agoogle_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"]: Creating...%0Agoogle_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"]: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Creating...%0A
::debug::stderr: %0AError: Error when reading or editing Resource gig-japan-398904 for IAM Member (role "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com", "roles/editor"): Request `Delete IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for "project \"gig-japan-398904\""` returned error: Batch request and retried single request "Delete IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for \"project \\\"gig-japan-398904\\\"\"" both failed. Final error: Error applying IAM policy for project "gig-japan-398904": Error setting IAM policy for project "gig-japan-398904": googleapi: Error 403: Policy update access denied., forbidden%0A%0A%0AError: Request `Create IAM Members roles/artifactregistry.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project "gig-japan-398904"` returned error: Batch request and retried single request "Create IAM Members roles/artifactregistry.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project \"gig-japan-398904\"" both failed. Final error: Error applying IAM policy for project "gig-japan-398904": Error setting IAM policy for project "gig-japan-398904": googleapi: Error 403: Policy update access denied., forbidden%0A%0A  with google_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"],%0A  on iam.tf line 54, in resource "google_project_iam_member" "gitops-sa-cloudstorage":%0A  54: resource "google_project_iam_member" "gitops-sa-cloudstorage" {%0A%0A%0AError: Request `Create IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project "gig-japan-398904"` returned error: Batch request and retried single request "Create IAM Members roles/editor serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project \"gig-japan-398904\"" both failed. Final error: Error applying IAM policy for project "gig-japan-398904": Error setting IAM policy for project "gig-japan-398904": googleapi: Error 403: Policy update access denied., forbidden%0A%0A  with google_project_iam_member.gitops-sa-cloudstorage["roles/editor"],%0A  on iam.tf line 54, in resource "google_project_iam_member" "gitops-sa-cloudstorage":%0A  54: resource "google_project_iam_member" "gitops-sa-cloudstorage" {%0A%0A%0AError: Request `Create IAM Members roles/secretmanager.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project "gig-japan-398904"` returned error: Batch request and retried single request "Create IAM Members roles/secretmanager.admin serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com for project \"gig-japan-398904\"" both failed. Final error: Error applying IAM policy for project "gig-japan-398904": Error setting IAM policy for project "gig-japan-398904": googleapi: Error 403: Policy update access denied., forbidden%0A%0A  with google_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"],%0A  on iam.tf line 54, in resource "google_project_iam_member" "gitops-sa-cloudstorage":%0A  54: resource "google_project_iam_member" "gitops-sa-cloudstorage" {%0A%0A%0AError: Error creating Repository: googleapi: Error 403: Permission denied on 'locations/asia-northeast' (or it may not exist).%0A%0A  with google_artifact_registry_repository.artifact-repository,%0A  on main.tf line 13, in resource "google_artifact_registry_repository" "artifact-repository":%0A  13: resource "google_artifact_registry_repository" "artifact-repository" {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":11,"Program":"tfcmt","SHA1":"3236afbf35760d3ed73cab48e1153ec439475645","Vars":{},"WorkflowName":"iaac_apply"} -->